
from locators.main_page_locators import MainLocators

text_of_question_1 = 'Сколько это стоит? И как оплатить?'
text_of_question_2 = 'Хочу сразу несколько самокатов! Так можно?'
text_of_question_3 = 'Как рассчитывается время аренды?'
text_of_question_4 = 'Можно ли заказать самокат прямо на сегодня?'
text_of_question_5 = 'Можно ли продлить заказ или вернуть самокат раньше?'
text_of_question_6 = 'Вы привозите зарядку вместе с самокатом?'
text_of_question_7 = 'Можно ли отменить заказ?'
text_of_question_8 = 'Я жизу за МКАДом, привезёте?'
text_of_reply_1 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
text_of_reply_2 = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'
text_of_reply_3 = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'
text_of_reply_4 = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
text_of_reply_5 = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
text_of_reply_6 = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'
text_of_reply_7 = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
text_of_reply_8 = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'

MAIN_PAGE_URL = 'https://qa-scooter.praktikum-services.ru/'
YANDEX = 'https://dzen.ru/?yredirect=true&is_autologin_ya=true'
ORDER_PAGE = 'https://qa-scooter.praktikum-services.ru/order'